music_app/app/controllers/albums_controller.rb

  def new
    @bands = Band.all
---
SELECT "bands".* FROM "bands"

  def create
    @album = Album.new(album_params)

    if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 1], ["title", "Album"], ["year", 2000], ["created_at", "2018-11-16 01:00:22.588831"], ["updated_at", "2018-11-16 01:00:22.588831"]]

  def edit
    @bands = Band.all
    @album = Album.find_by(id: params[:id])
---
SELECT "bands".* FROM "bands"
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @album = Album.find_by(id: params[:id])

    if @album.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["year", 2002], ["updated_at", "2018-11-16 01:13:16.417503"], ["id", 1]]