music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "The Other Band"], ["updated_at", "2018-11-15 22:28:49.003307"], ["id", 1]]
---
  def update
    @band = Band.find_by(id: params[:id])
    debugger
    if @band.update_attributes(band_params)